//////////////////////////////////////////////////////////////////////////
//                                                                      //
//            Базовое программное обеспечение нейропроцессора           //
//                                                                      //
//        Библиотека доступа к отладочной информации формата DWARF      //
//                                                                      //
//                Интерфейсный файл pro_mac.hpp                         //
//                                                                      //
//  Файл определяет служебный класс  интерфейса создания                //
//  Dwarf_P_Macinfo                                                     //
//                                                                      //
//                                                                                         //
//  If this code works, it was                                                         //
//  If not, I don't know who wrote it.                                  //
//                                                                      //
// $Revision:: 1     $      $Date:: 7/21/05 5:32p    $                  //
//                                                                      //
//////////////////////////////////////////////////////////////////////////

//-------------------------------------------------------------------//
//
//
//
//-------------------------------------------------------------------//

class Dwarf_P_Macinfo {
	public:
		char *dpm_name;
		char *dpm_value;

		Dwarf_P_Macinfo	*next;
};
