//////////////////////////////////////////////////////////////////////////
//                                                                      //
//            Базовое программное обеспечение нейропроцессора           //
//                                                                      //
//       Библиотека доступа к отладочной информации формата DWARF       //
//                                                                      //
//               Реализационный модуль pro_aran.cpp                     //
//                                                                      //
//  Файл реализации функций класса Dwarf_P_Arange                       //
//                                                                      //
//                                                                                         //
//  If this code works, it was                                                         //
//  If not, I don't know who wrote it.                                  //
//                                                                      //
// $Revision:: 1     $      $Date:: 7/21/05 5:33p    $                  //
//                                                                      //
//////////////////////////////////////////////////////////////////////////

//---------------------------------------------------------
//
// class Dwarf_P_Arange
//
//---------------------------------------------------------

#include <string.h>

#include "libelf.h"
#include "dwarferr.h"
#include "dwarftyp.h"
#include "dwarf.h"
#include "libdwarf.h"
#include "dwarfint.h"

#include "pro_aran.h"
#include "pro_dbg.h"


/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//              Конец реализационного модуля pro_aran.cpp                  //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////
